emacs/.config/emacs/emacs.org
#+title: Configuración literaria de Emacs
#+author: Juan E. Gómez-Morantes, PhD.

#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Introducción
Este archivo presenta una configuración literaria de emacs. En muchas partes se usa la funcionalidad =noweb= de =org= para tener una mejor trazabilidad y documentación de configuraciones complejas. En https://www.hhyu.org/posts/literate_config/ se puede encontrar más información al respecto.
  
* Manejador de paquetes
Esta configuración está basada en =straight= y =use-package=. En esta sección se =straight= siguiendo las instrucciones encontradas en https://github.com/raxod502/straight.el, y se hace la configuración inicial para la instalación de =use-package= y su integración con =straight=.

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
                                      'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src 
  
* Interfaz
** Configuración básica
#+begin_src emacs-lisp
  (scroll-bar-mode -1)        ; Desabilitar el scroll bar
  (tool-bar-mode -1)          ; Desabilitar la barra de herramientas
  (tooltip-mode -1)           ; Desabilitar tool tips
  (set-fringe-mode 10)        ; Dar algo de espacio entre ventanas
  (menu-bar-mode -1)          ; Desabilitar barra de menú
  (global-visual-line-mode)   ; Word wrapping por defecto en todos los modos
  (global-auto-revert-mode t) ; Activar global auto-revert 
#+end_src
** Fuentes
Uso [[https://github.com/DeLaGuardo/Inconsolata-LGC][Inconsolata-LGC]] (la inconsolata normal no tiene cursiva) como fuente global de emacs. Algunos modos cambian la fuente.

La lista de fuentes disponibles para emacs se puede consultar ejecutando el siguiente bloque de código:

#+begin_src emacs-lisp :tangle no
(font-family-list)
#+end_src

Para poder usar inconsolata, es imporante verificar que esté disponible en esa lista.

#+begin_src emacs-lisp 
  (set-face-attribute 'fixed-pitch nil :font "Inconsolata LGC")
  (set-frame-font "Inconsolata LGC" nil t)
#+end_src

Para esto, la fuente debe estar instalada correctamente en el sistema. Si se usa desde wsl, se debe agregar la fuente a Ubuntu, no a Vcxsrv o al servidor de X11 que se esté usando. Esto se hace copiando la fuente a la carpeta apropiada dentro de =/usr/share/fonts= y actualizando el caché de fuentes de ubuntu con =sudo fc-cache -vr=. Luego de esto se puede verificar que la fuente quedó instalada ejecuntado =(font-family-list)= en emacs. Para este último paso lo más fácil es hacerlo dentro de un archivo de org tal y como se está realizando esta configuración y ejecutando el bloque de código respectivo.

** =evil=
=evil= permite edición modal y uso de acordes estilo vim en Emacs. Esta sección se limita a instalación y configuración básica de =evil= y =general= (para la definición de acordes locales). Luego, en las secciones correspondientes a cada paquete, se hace la configuración de los acordes locales.
*** Configuración de =evil=
#+begin_src emacs-lisp
  (use-package evil
    :custom
    ;; Inicia en modo NORMAL por defecto en todos los modos
    (evil-default-state 'normal)
    ;; Para evitar conflictos con TAB en org-mode
    (evil-want-C-i-jump nil)
    ;; Evitar conflictos con evil-collecction
    (evil-want-keybinding nil)
    :config
    ;; Arracnar evil-mode por defecto
    (evil-mode))
#+end_src
    
*** Configuración de =general=
=general= es un paquete que ayuda a definir teclas líderes para diferentes conceptos, y es integrable con =use-package= usando la opción =:general=. En esta sección se define una tecla lider general (SPC) para arcordes globales y una tecla lider local (SPC m) para acordes relativos al modo actual.

#+begin_src emacs-lisp
  (use-package general
    :after evil
    :config
    ;; defniciión de tecla lider global para modo normal.
    (general-create-definer j/lider
      :states '(normal insert emacs)
      :keymaps 'override
      :prefix "SPC"
      :non-normal-prefix "M-SPC")

    ;; definición de tecla lider local (relativo al major mode) para modo normal.
    (general-create-definer j/lider-local
      :states '(normal insert emacs)
      :prefix "SPC m"
      :non-normal-prefix "M-SPC m"))
#+end_src

*** Configuración de =evil-collection=
=evil-collection= trae acorder por defecto para muchos modos.

#+begin_src emacs-lisp
  (use-package evil-collection
    :config
    (evil-collection-init))
#+end_src

** =ivy= et. al.
Esta configuración hace uso extensivo de =ivy= y =cousel= para terminación. En esta sección se hacen todas las configuraciones relevantes al sistema de terminación.
  
*** TODO Configuración inicial de =ivy=
(ver cómo se pueden configurar =C-j= y =C-k= en =ivy-minibuffer-map= usando general)

#+begin_src emacs-lisp :noweb no-export
  (use-package ivy
    :diminish ivy-mode
    :bind (:map ivy-minibuffer-map
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line))
    :config
    (ivy-mode 1))
#+end_src

*** Configuración de =counsel=
Activo counsel y enlazo =M-x= a =counsel-M-x=. Con esto se logra ver los binds actuales de los comandos. También se usa =counsel= en otros puntos de esta configuración como por ejemplo en los acordes de apertura de archivo.
    
#+begin_src emacs-lisp
  (use-package counsel
    :after ivy
    :config
    (global-set-key (kbd "M-x") 'counsel-M-x))
#+end_src

*** =ivy-rich= y =all-the-icons-ivy-rich=
Estos dos paquetes se usan para agregar íconos a ivy. Por ejemplo, agrega íconos a la selección de buffers o de apertura de archivos.
    
#+begin_src emacs-lisp
  (use-package ivy-rich
    :after (ivy counsel)
    :init
    (ivy-rich-mode 1))

  (use-package all-the-icons-ivy-rich
    :after ivy-rich
    :init (all-the-icons-ivy-rich-mode 1))
#+end_src

*** =prescient=
=presciente= le ayuda a =ivy= a mostrar opciones recientes y frecuentes en el tope de las listas mostradas para terminación.
  
#+begin_src emacs-lisp
  (use-package prescient
    :after ivy
    :config
    (use-package ivy-prescient
      :after counsel
      :config
      (ivy-prescient-mode)
      (prescient-persist-mode)))
#+end_src

** =all-the-icons=
Este paquete instala fuentes con íconos que son usadas por muchos otros paquetes (e.g. [[Doom modeline]], Dired, [[ivy]], entre otros). Si luego de esta configuración no se logran visualizar los íconos, es porque falta ejecutar =(all-the-icons-install-fonts)=.

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

** =doom-modeline=
#+begin_src emacs-lisp
  (use-package doom-modeline
    :after 
    all-the-icons
    :init 
    ;; Activar doom-modeline en todos los modos
    (doom-modeline-mode 1))
#+End_src

** =which-key=
=which-key= es un paquete que muestra los acordes disponibles luego de iniciar un acorde normal o tipo vim. Lo que hace es mostrar un diálogo que muestra las opciones disponibles luego de iniciar un comando. Por ejemplo, si se presiona =C-c=, =which-key= muestra un diálogo con todos los comandos que se pueden ejecutar luego de =C-c= y la descripción de la función a ejecutar. También muestra comandos que abren más opciones (e.g. =C-c C-x=). 

#+begin_src emacs-lisp
  (use-package which-key
    :config
    (which-key-mode))
#+end_src

** Tema gráfico
Uso el tema gráfico =modus-vivendi= de Protesilaos (https://gitlab.com/protesilaos/modus-themes).

#+begin_src emacs-lisp
  (use-package modus-themes
    :config
    ;; Cargar los temas
    (modus-themes-load-themes)
    ;; Cargar modus-vivendi
    (modus-themes-load-vivendi))
#+end_src

** =helpful=
=helpful= es un paquete que mejora sustancialmente los /buffers/ de ayuda estándares de Emacs. Se carga después de general para integrarlo con ese paquete.

#+begin_src emacs-lisp
  (use-package helpful
    :after
    counsel
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable))
#+end_src

** =rainbow delimiters=
Este paquete agrega color a los paréntesis para tener una referencia gráfica de parejas de paréntesis.
   
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (org-mode . rainbow-delimiters-mode))
#+end_src

** Acordes generales
*** Operaciones sobre modos de edición
#+begin_src emacs-lisp
  (j/lider
   "SPC" '(evil-normal-state :which-key "volver a modo normal"))
#+end_src

*** Acordes de archivos
#+begin_src emacs-lisp
  (j/lider
    :infix "a"
    "" '(:ignore t :which-key "archivo")
    "a" '(counsel-find-file :which-key "abrir archivo")
    "A" '(counsel-recentf :which-key "abrir reciente")
    "g" '(save-buffer :which-key "guardar")
    "e" '(j/delete-file-and-buffer :which-key "cerrar y eliminar")
    "G" '(write-file :which-key "guardar como"))
#+end_src

Algunas opciones de menú de archivo requieren funciones auxiliares:
#+begin_src emacs-lisp
  (defun j/delete-file-and-buffer ()
    "Eliminar el archivo actual del disco duro y cierra su buffer"
    (interactive)
    (let ((filename (buffer-file-name)))
      (if filename
          (if (y-or-n-p (concat "De verdad quiere eliminar " filename " ?"))
              (progn
                (delete-file filename)
                (message "%s eliminado." filename)
                (kill-buffer)))
        (message "Este buffer no representaba un archivo"))))
#+end_src

*** Operaciones sobre ventanas
#+begin_src emacs-lisp
  (j/lider
    :infix "v"
    "" '(:ignore t :which-key "window")
    "e" '(evil-window-delete :which-key "cerrar ventaan")
    "d" '(evil-window-split :which-key "dividir horizontalmente")
    "<" '(evil-window-decrease-width :which-key "reducir ancho")
    ">" '(evil-window-increase-width :which-key "aumentar ancho")
    "j" '(evil-window-down :which-key "ir abajo")
    "q" '(evil-quit-all :which-key "salir de emacs")
    "k" '(evil-window-up :which-key "ir arriba")
    "h" '(evil-window-left :which-key "ir a izquierda")
    "l" '(evil-window-right :which-key "ir a derecha")
    "o" '(delete-other-windows :which-key "cerrar otras ventanas")
    "TAB" '(evil-window-next :which-key "siguiente ventana")
    "v" '(evil-window-vsplit :which-key "dividir verticalmente"))
#+end_src

