emacs/.config/emacs/init.el
(setq package-enable-at-startup nil)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
                                    'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(scroll-bar-mode -1)        ; Desabilitar el scroll bar
(tool-bar-mode -1)          ; Desabilitar la barra de herramientas
(tooltip-mode -1)           ; Desabilitar tool tips
(set-fringe-mode 10)        ; Dar algo de espacio entre ventanas
(menu-bar-mode -1)          ; Desabilitar barra de menú
(global-visual-line-mode)   ; Word wrapping por defecto en todos los modos
(global-auto-revert-mode t) ; Activar global auto-revert

(set-face-attribute 'fixed-pitch nil :font "Inconsolata Nerd Font 11")
(set-frame-font "Inconsolata Nerd Font 11" nil t)

(use-package evil
  :custom
  ;; Inicia en modo NORMAL por defecto en todos los modos
  (evil-default-state 'normal)
  ;; Para evitar conflictos con TAB en org-mode
  (evil-want-C-i-jump nil)
  ;; Evitar conflictos con evil-collecction
  (evil-want-keybinding nil)
  :config
  ;; Arracnar evil-mode por defecto
  (evil-mode))

(use-package general
  :after evil
  :config
  ;; defniciión de tecla lider global para modo normal.
  (general-create-definer j/lider
    :states '(normal insert emacs)
    :keymaps 'override
    :prefix "SPC"
    :non-normal-prefix "M-SPC")

  ;; definición de tecla lider local (relativo al major mode) para modo normal.
  (general-create-definer j/lider-local
    :states '(normal insert emacs)
    :prefix "SPC m"
    :non-normal-prefix "M-SPC m"))

(use-package evil-collection
  :config
  (evil-collection-init))

(use-package ivy
  :diminish ivy-mode
  :bind (:map ivy-minibuffer-map
       ("C-j" . ivy-next-line)
       ("C-k" . ivy-previous-line))
  :config
  (ivy-mode 1))

(use-package counsel
  :after ivy
  :config
  (global-set-key (kbd "M-x") 'counsel-M-x))

(use-package ivy-rich
  :after (ivy counsel)
  :init
  (ivy-rich-mode 1))

(use-package all-the-icons-ivy-rich
  :after ivy-rich
  :init (all-the-icons-ivy-rich-mode 1))

(use-package prescient
  :after ivy
  :config
  (use-package ivy-prescient
    :after counsel
    :config
    (ivy-prescient-mode)
    (prescient-persist-mode)))

(use-package all-the-icons)

(use-package doom-modeline
  :after 
  all-the-icons
  :init 
  ;; Activar doom-modeline en todos los modos
  (doom-modeline-mode 1))

(use-package which-key
  :config
  (which-key-mode))

(use-package modus-themes
  :config
  ;; Cargar los temas
  (modus-themes-load-themes)
  ;; Cargar modus-vivendi
  (modus-themes-load-vivendi))

(use-package helpful
  :after
  counsel
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable))

(use-package rainbow-delimiters
  :hook (org-mode . rainbow-delimiters-mode))

(j/lider
 "SPC" '(evil-normal-state :which-key "volver a modo normal"))

(j/lider
  :infix "a"
  "" '(:ignore t :which-key "archivo")
  "a" '(counsel-find-file :which-key "abrir archivo")
  "A" '(counsel-recentf :which-key "abrir reciente")
  "g" '(save-buffer :which-key "guardar")
  "e" '(j/delete-file-and-buffer :which-key "cerrar y eliminar")
  "G" '(write-file :which-key "guardar como"))

(defun j/delete-file-and-buffer ()
  "Eliminar el archivo actual del disco duro y cierra su buffer"
  (interactive)
  (let ((filename (buffer-file-name)))
    (if filename
        (if (y-or-n-p (concat "De verdad quiere eliminar " filename " ?"))
            (progn
              (delete-file filename)
              (message "%s eliminado." filename)
              (kill-buffer)))
      (message "Este buffer no representaba un archivo"))))

(j/lider
  :infix "v"
  "" '(:ignore t :which-key "window")
  "e" '(evil-window-delete :which-key "cerrar ventaan")
  "d" '(evil-window-split :which-key "dividir horizontalmente")
  "<" '(evil-window-decrease-width :which-key "reducir ancho")
  ">" '(evil-window-increase-width :which-key "aumentar ancho")
  "j" '(evil-window-down :which-key "ir abajo")
  "q" '(evil-quit-all :which-key "salir de emacs")
  "k" '(evil-window-up :which-key "ir arriba")
  "h" '(evil-window-left :which-key "ir a izquierda")
  "l" '(evil-window-right :which-key "ir a derecha")
  "o" '(delete-other-windows :which-key "cerrar otras ventanas")
  "TAB" '(evil-window-next :which-key "siguiente ventana")
  "v" '(evil-window-vsplit :which-key "dividir verticalmente"))

(j/lider
  :infix "b"
