emacs/.config/emacs/emacs.org
** Actualización automática de tareas FUTU
Esta sección define una serie de funciones para usar tareas con estado =FUTU=. Estas son tareas que no aparecen como accionables, pero que se vuelven accionables en una fecha específica. Se usan para tareas que se quieren registrar con anticipación, pero que sólo se puede empezar luego de una fecha específica. 

La función =j/org-set-futu= se usa para asignar el estado =FUTU= a una tarea, preguntando antes cuál es la fecha en la que se convierte en accionable. La función =j/org-verify-actionable-tasks= revisa todas las tareas de archivos registrados como en =org-agenda-files= y, si encuentra tareas con estado =FUTU= y una fecha igual o menor a la actual en la propiedad =ACTIONABLE=, las pasa a estado =TODO= y les quita la propiedad =ACTIONABLE=.
   
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (defun j/org-evaluate-if-actionable ()
    "Returns t if the task at point is actionable or nil if it isn't"
    (and (org-entry-get (point) "ACTIONABLE")
         (string< (org-read-date nil nil (org-entry-get (point) "ACTIONABLE"))
                  (org-read-date nil nil "+1"))))

  (defun j/org-process-task ()
    "Vefifies if a task is actionable. If it is, set it as actionable"
    (when (j/org-evaluate-if-actionable)
      (org-todo "TODO")
      (org-delete-property "ACTIONABLE")))

  (defun j/org-verify-actionable-tasks ()
    "Goes through al agenda files checking if FUTU tasks are actionable"
    (org-map-entries
     '(j/org-process-task)
     "/+FUTU" 'agenda))

  ;; Ejecutar j/org-verify-actionable-tasks cada vez que se corra la agenda. Lo hace antes de que se calcula le agenda.
  (add-hook 'org-agenda-mode-hook #'j/org-actionable)
  (defun j/org-actionable ()
    (j/org-verify-actionable-tasks))

  (defun j/org-set-futu ()
    "Cambiar el estado de una tarea a FUTU y definir la fecha en que se convierte en accionable"
    (interactive)
    (org-set-property "ACTIONABLE" (concat "[" (org-read-date nil nil nil "ACTIONABLE: ") "]"))
    (org-todo "FUTU"))
   #+end_src

** =org-superstar-mode=
=org-superstar= es un paquete que mejora el aspecto visual de archivos =org=.  

#+begin_src emacs-lisp
  (use-package org-superstar
    :hook (org-mode . org-superstar-mode))
#+end_src

** Exportación a latex
Uso tectonic como distribución de latex en (ambientes linux).

#+begin_src emacs-lisp :tangle no :noweb-ref org-custom
(org-latex-pdf-process '("tectonic %f"))
#+end_src

** Configuración de agenda
*** Definición de archivos de agenda
#+begin_src emacs-lisp :tangle no :noweb-ref org-custom
(org-agenda-files '("~/personal/orgmode/gtd.org"))
#+end_src
*** Mostrar la agenda en la ventana actual
#+begin_src emacs-lisp :tangle no :noweb-ref org-custom
(org-agenda-window-setup 'current-window)
#+end_src

** =org-ref=
=org-ref= permite usar referencias bibliográficas en formato bibtex desde =org=.

#+begin_src emacs-lisp :noweb no-export
  (use-package org-ref
    :after org
    :custom
    <<org-ref-custom>>
    :config
    <<org-ref-config>>)
#+end_src

*** Configuración básica
#+begin_src emacs-lisp :tangle no :noweb-ref org-ref-custom
  (org-ref-default-citation-link "citep")
  (reftex-default-bibliography '("~/biblioteca/main.bib"))
  (org-ref-default-bibliography '("~/biblioteca/main.bib"))
  (org-ref-pdf-directory "~/biblioteca/")
  (bibtex-dialect 'biblatex)
#+end_src

*** Integrar con =ivy= por defecto
#+begin_src emacs-lisp :tangle no :noweb-ref org-ref-config
    (org-ref-ivy-cite-completion)
#+end_src

*** Acordes relevantes
#+begin_src emacs-lisp :tangle no :noweb-ref org-ref-config
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps 'org-mode-map
    "}" '(org-ref-ivy-insert-ref-link :which-key "insertar referencia")
    "]" '(org-ref-ivy-insert-cite-link :which-key "insertar cita"))
#+end_src

** =org-refile=
Configuración necesaria para que org-refile tome en cuenta elementos hasta de nivel 4 en el archivo actual. 
#+begin_src emacs-lisp :tangle no :noweb-ref org-custom
  ;; Destinos hasta de nivel 3
  (org-refile-targets '((org-agenda-files :maxlevel . 3)))
  ;; Construcción del destino paso a paso
  (org-refile-use-outline-path 'file)
  (org-outline-path-complete-in-steps nil)
#+end_src
 
*** Acordes  
#+begin_src emacs-lisp :tangle no :noweb-ref org-custom
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps '(org-capture-mode-map)
    "r"   '(org-capture-refile :which-key "refile"))
#+end_src

** =org-capture=
Uso =org-capture= para captura de tareas, ideas, y notas. Lo hago definiendo plantillas para diferentes elementos que quiero captura y ejecutándolos cuando sea necesario.
 
*** Plantillas
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  ;; Definir la lista DESPUÉS de cargar org-capture. Esto es necesario porque de no tenerlo la lista de plantillas se reiniciaba
  
  (with-eval-after-load 'org-capture       
    (add-to-list 'org-capture-templates
                 '("l" "Tarea enlazada" ; l para una terea que incluya enlace a documento o correo
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %?\nOrigen o referencia: %a\n"))
    (add-to-list 'org-capture-templates
                 '("c" "Tarea de clipboard" ; c para una tarea que referencia información contenida en clipboard
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %? \n %x"))
    (add-to-list 'org-capture-templates
                 '("t" "Tarea simple" ; l para una terea que incluya enlace a documento o correo
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %? \n")))
  #+end_src

*** Acorde de acceso directo  
Esto acceso directo funciona desde cualquier modo
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (j/lider
    "c" '(org-capture :which-key "org-capture"))
#+end_src

** Hábitos
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (add-to-list 'org-modules 'org-habit)
#+end_src

** Acordes locales
*** De movimiento
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (general-define-key
   :states '(normal)
   :keymaps '(org-mode-map)
   "K"   '(org-previous-visible-heading :which-key "Encabezado previo")
   "J"   '(org-next-visible-heading :which-key "Encabezado siguiente")
   "H"   '(outline-up-heading :which-key "Encabezado siguiente"))
#+end_src

*** De interacción con archivo
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (general-define-key
   :states '(normal)
   :keymaps '(org-mode-map)
   "RET" '(j/dwim-at-point :which-key "dwim"))
  
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps '(org-mode-map)
    "T"    '(org-babel-tangle :which-key "tangle"))
#+end_src

*** De operación sobre tareas o exportación
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps '(org-mode-map)
    "a"   '(org-archive-subtree-default :which-key "archivar")
    "p"   '(org-priority :which-key "prioridad")
    "q"   '(org-set-tags-command :which-key "etiquetas")
    "o"   '(org-set-property :which-key "propiedades")
    "t"   '(org-todo :which-key "propiedades")
    "r"   '(org-refile :which-key "refile")
    "e"   '(org-export-dispatch :which-key "exportar"))
#+end_src

*** De reloj 
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (j/lider-local
    :infix "j"
    :keymaps '(org-mode-map)
    "" '(:ignore t :which-key "reloj")
    "e" '(org-set-effort :which-key "definir esfuerzo")
    "E" '(org-inc-effort :which-key "aumentar esfuerzo")
    "i" '(org-clock-in :which-key "iniciar reloj")
    "I" '(org-clock-in-last :which-key "continuar reloj")
    "g" '(org-clock-goto :which-key "ir a actual")
    "c" '(org-clock-cancel :which-key "cancelar reloj")
    "o" '(org-clock-out :which-key "cerrar y eliminar"))
  
  ;; Manipulación del reloj desde menú de accesos directos 
  (j/lider
    :infix "o j"
    "" '(:ignore t :which-key "reloj")
    "I" '(org-clock-in-last :which-key "continuar reloj")
    "c" '(org-clock-cancel :which-key "cancelar reloj")
    "o" '(org-clock-out :which-key "cerrar y eliminar"))
#+end_src

*** De calendario
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (j/lider-local
    :infix "c"
    :keymaps '(org-mode-map)
    "" '(:ignore t :which-key "Calendario")
    "d" '(org-deadline :which-key "definir deadline")
    "f" '(j/org-set-futu :which-key "A futuro")
    "c" '(org-schedule :which-key "agendar"))
#+end_src

*** De agenda
Lo primero que se tiene que hacer con la agenda es indicar que debe iniciar en modo NORMAL de =evil= para tener acceso a todos los acordes globales.

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (add-to-list 'evil-normal-state-modes 'org-agenda-mode)
#+end_src

Ya con esto, se tienen que definir los acrodes locales para agenda.
#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (general-define-key
   :states '(normal)
   :keymaps '(org-agenda-mode-map)
   "q" '(org-agenda-quit :which-key "salir")
   "r" '(org-agenda-redo :which-key "refrescar")
   "t" '(org-agenda-todo :which-key "cambiar estado")
   "c" '(org-agenda-schedule :which-key "agendar")
   "a" '(org-agenda-archive :which-key "archivar")
   "d" '(org-agenda-deadline :which-key "fecha límite")
   "p" '(org-agenda-priority :which-key "cambiar prioridad")
   "i" '(org-agenda-clock-in :which-key "iniciar reloj")
   "o" '(org-agenda-clock-out :which-key "cerrar reloj")
   "G" '(org-save-all-org-buffers :which-key "guardar archivos org")
   "RET" '(org-agenda-switch-to :which-key "visitar"))
#+end_src

#+RESULTS:

** Exportación a latex
