emacs/.config/emacs/init.el
  (defun j/org-evaluate-if-actionable ()
    "Returns t if the task at point is actionable or nil if it isn't"
    (and (org-entry-get (point) "ACTIONABLE")
         (string< (org-read-date nil nil (org-entry-get (point) "ACTIONABLE"))
                  (org-read-date nil nil "+1"))))
  
  (defun j/org-process-task ()
    "Vefifies if a task is actionable. If it is, set it as actionable"
    (when (j/org-evaluate-if-actionable)
      (org-todo "TODO")
      (org-delete-property "ACTIONABLE")))
  
  (defun j/org-verify-actionable-tasks ()
    "Goes through al agenda files checking if FUTU tasks are actionable"
    (org-map-entries
     '(j/org-process-task)
     "/+FUTU" 'agenda))
  
  ;; Ejecutar j/org-verify-actionable-tasks cada vez que se corra la agenda. Lo hace antes de que se calcula le agenda.
  (add-hook 'org-agenda-mode-hook #'j/org-actionable)
  (defun j/org-actionable ()
    (j/org-verify-actionable-tasks))
  
  (defun j/org-set-futu ()
    "Cambiar el estado de una tarea a FUTU y definir la fecha en que se convierte en accionable"
    (interactive)
    (org-set-property "ACTIONABLE" (concat "[" (org-read-date nil nil nil "ACTIONABLE: ") "]"))
    (org-todo "FUTU"))
  ;; Definir la lista DESPUÉS de cargar org-capture. Esto es necesario porque de no tenerlo la lista de plantillas se reiniciaba
  
  (with-eval-after-load 'org-capture       
    (add-to-list 'org-capture-templates
                 '("l" "Tarea enlazada" ; l para una terea que incluya enlace a documento o correo
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %?\nOrigen o referencia: %a\n"))
    (add-to-list 'org-capture-templates
                 '("c" "Tarea de clipboard" ; c para una tarea que referencia información contenida en clipboard
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %? \n %x"))
    (add-to-list 'org-capture-templates
                 '("t" "Tarea simple" ; l para una terea que incluya enlace a documento o correo
                   entry
                   (file+headline
                    "~/personal/orgmode/gtd.org" ; Guardar en gtd.org
                    "Inbox") ; Guarda por defecto en el headline Inbox
                   "* TODO [#D] %? \n")))
  (j/lider
    "c" '(org-capture :which-key "org-capture"))
  (add-to-list 'org-modules 'org-habit)
  (general-define-key
   :states '(normal)
   :keymaps '(org-mode-map)
   "K"   '(org-previous-visible-heading :which-key "Encabezado previo")
   "J"   '(org-next-visible-heading :which-key "Encabezado siguiente")
   "H"   '(outline-up-heading :which-key "Encabezado siguiente"))
  (general-define-key
   :states '(normal)
   :keymaps '(org-mode-map)
   "RET" '(j/dwim-at-point :which-key "dwim"))
  
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps '(org-mode-map)
    "T"    '(org-babel-tangle :which-key "tangle"))
  (j/lider-local
    :states '(normal insert emacs)
    :keymaps '(org-mode-map)
    "a"   '(org-archive-subtree-default :which-key "archivar")
    "p"   '(org-priority :which-key "prioridad")
    "q"   '(org-set-tags-command :which-key "etiquetas")
    "o"   '(org-set-property :which-key "propiedades")
    "t"   '(org-todo :which-key "propiedades")
    "r"   '(org-refile :which-key "refile")
    "e"   '(org-export-dispatch :which-key "exportar"))
  (j/lider-local
    :infix "j"
    :keymaps '(org-mode-map)
    "" '(:ignore t :which-key "reloj")
    "e" '(org-set-effort :which-key "definir esfuerzo")
    "E" '(org-inc-effort :which-key "aumentar esfuerzo")
    "i" '(org-clock-in :which-key "iniciar reloj")
    "I" '(org-clock-in-last :which-key "continuar reloj")
    "g" '(org-clock-goto :which-key "ir a actual")
    "c" '(org-clock-cancel :which-key "cancelar reloj")
    "o" '(org-clock-out :which-key "cerrar y eliminar"))
  
  ;; Manipulación del reloj desde menú de accesos directos 
  (j/lider
    :infix "o j"
    "" '(:ignore t :which-key "reloj")
    "I" '(org-clock-in-last :which-key "continuar reloj")
    "c" '(org-clock-cancel :which-key "cancelar reloj")
    "o" '(org-clock-out :which-key "cerrar y eliminar"))
  (j/lider-local
    :infix "c"
    :keymaps '(org-mode-map)
    "" '(:ignore t :which-key "Calendario")
    "d" '(org-deadline :which-key "definir deadline")
    "f" '(j/org-set-futu :which-key "A futuro")
    "c" '(org-schedule :which-key "agendar"))
  (add-to-list 'evil-normal-state-modes 'org-agenda-mode)
  (general-define-key
   :states '(normal)
   :keymaps '(org-agenda-mode-map)
   "q" '(org-agenda-quit :which-key "salir")
   "r" '(org-agenda-redo :which-key "refrescar")
   "t" '(org-agenda-todo :which-key "cambiar estado")
   "c" '(org-agenda-schedule :which-key "agendar")
   "a" '(org-agenda-archive :which-key "archivar")
   "d" '(org-agenda-deadline :which-key "fecha límite")
   "p" '(org-agenda-priority :which-key "cambiar prioridad")
   "i" '(org-agenda-clock-in :which-key "iniciar reloj")
   "o" '(org-agenda-clock-out :which-key "cerrar reloj")
   "G" '(org-save-all-org-buffers :which-key "guardar archivos org")
   "RET" '(org-agenda-switch-to :which-key "visitar"))
